fabiopjve/RL78/Microcontroladores RL78/Cap10/Exemplo2/fsl.h
/*================================================================================================*/
/* Project      = Flash self-programming library                                                  */
/* Module       = fsl.h                                                                           */
/* Device:      = RL78                                                                            */
/* Version      = V2.11                                                                           */
/*================================================================================================*/
/*                                  COPYRIGHT                                                     */
/*================================================================================================*/
/* Copyright(c) 2010-2011 by Renesas Electronics Europe GmbH,a company of the Renesas Electronics */
/* Corporation. All rights reserved.                                                              */
/*================================================================================================*/
/* Purpose:     constant and function prototype definitions used by the FSL                       */
/*================================================================================================*/
/*                                                                                                */
/* Warranty Disclaimer                                                                            */
/*                                                                                                */
/* Because the Product(s) is licensed free of charge, there is no warranty of any kind whatsoever */
/* and expressly disclaimed and excluded by Renesas, either expressed or implied, including but   */
/* not limited to those for non-infringement of intellectual property, merchantability and/or     */
/* fitness for the particular purpose.                                                            */
/* Renesas shall not have any obligation to maintain, service or provide bug fixes for the        */
/* supplied Product(s) and/or the Application.                                                    */
/*                                                                                                */
/* Each User is solely responsible for determining the appropriateness of using the Product(s)    */
/* and assumes all risks associated with its exercise of rights under this Agreement, including,  */
/* but not limited to the risks and costs of program errors, compliance with applicable laws,     */
/* damage to or loss of data, programs or equipment, and unavailability or interruption of        */
/* operations.                                                                                    */
/*                                                                                                */
/* Limitation of Liability                                                                        */
/*                                                                                                */
/* In no event shall Renesas be liable to the User for any incidental, consequential, indirect,   */
/* or punitive damage (including but not limited to lost profits) regardless of whether such      */
/* liability is based on breach of contract, tort, strict liability, breach of warranties,        */
/* failure of essential purpose or otherwise and even if advised of the possibility of such       */
/* damages. Renesas shall not be liable for any services or products provided by third party      */
/* vendors, developers or consultants identified or referred to the User by Renesas in            */
/* connection with the Product(s) and/or the Application.                                         */
/*                                                                                                */
/*================================================================================================*/
/* Environment: IAR environment for RL78                                                          */
/*================================================================================================*/

#ifndef __FSL_H_INCLUDED
#define __FSL_H_INCLUDED


/*==============================================================================================*/
/* include files list                                                                           */
/*==============================================================================================*/
#include "fsl_types.h"


/*==============================================================================================*/
/* constant definitions                                                                         */
/*==============================================================================================*/

/*status code definitions returned by the FSL functions                                         */
#define   FSL_OK                    0x00      /* no problems                                    */
#define   FSL_ERR_PARAMETER         0x05      /* parameter error                                */
#define   FSL_ERR_PROTECTION        0x10      /* protection error (access right conflict)       */
#define   FSL_ERR_ERASE             0x1A      /* erase error                                    */
#define   FSL_ERR_BLANKCHECK        0x1B      /* blankcheck error (MRG11)                       */
#define   FSL_ERR_IVERIFY           0x1B      /* internal verify error (MRG11)                  */
#define   FSL_ERR_WRITE             0x1C      /* write error                                    */
#define   FSL_ERR_FLOW              0x1F      /* flow error (wrong timing calling)              */
#define   FSL_IDLE                  0x30      /* idle state (any action is not running)         */
#define   FSL_SUSPEND               0x43      /* previous flash action is suspended             */
#define   FSL_BUSY                  0xFF      /* command is being processed                     */


/*==============================================================================================*/
/* global function prototypes                                                                   */
/*==============================================================================================*/


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      copies the content of FSL_RCD_ROM segment into the RAM                         */
/*                                                                                              */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern __far_func void FSL_CopySection(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      initialization of flash environment                                            */
/*                                                                                              */
/* Input:        *descriptor_pstr - FSL descriptor                                              */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status_code                                                           */
/*                   = 0x00(FSL_OK), normal and means initialization OK                         */
/*                   = 0x05(FSL_ERR_PARAMETER), parameter error or internal high-speed          */
/*                                              oscillator isn't started                        */
/*----------------------------------------------------------------------------------------------*/
extern __far_func fsl_u08  FSL_Init(const __far fsl_descriptor_t __far* descriptor_pstr);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      opens flash environment                                                        */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern __far_func void  FSL_Open(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      closes flash environment                                                       */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern __far_func void  FSL_Close(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      prepares following functions to be called                                      */
/*               FSL_BlankCheck, FSL_Erase, FSL_Write, FSL_IVerify, FSL_StatusCheck             */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern __far_func void  FSL_PrepareFunctions(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      prepares following functions to be called                                      */
/*               FSL_Set*ProtectFlag, FSL_InvertBootFlag, FSL_SetFlashShieldWindow,             */
/*               FSL_SwapBootCluster, FSL_SwapActiveBootCluster                                 */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern __far_func void  FSL_PrepareExtFunctions(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      changes all vector addresses to specified address in RAM                       */
/* Input:        fsl_interrupt_destination_u16 - vector address in RAM (Lower 16 bits address)  */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern __far_func void  FSL_ChangeInterruptTable(fsl_u16 fsl_interrupt_destination_u16);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      restores all vector addresses to initial vector addresses                      */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern __far_func void  FSL_RestoreInterruptTable(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      checks if specified block is blank                                             */
/* Input:        block_u16 - block number has to be checked                                     */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status_code                                                           */
/*                   = 0x00(FSL_OK), normal and means "block is blank"                          */
/*                   = 0x05(FSL_ERR_PARAMETER), parameter error                                 */
/*                   = 0x1B(FSL_ERR_BLANKCHECK), blank-check error, means "block is not blank"  */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0xFF(FSL_BUSY), normal and means "process was started"                   */
/*----------------------------------------------------------------------------------------------*/
extern __far_func fsl_u08  FSL_BlankCheck(fsl_u16 block_u16);


/*----------------------------------------------------------------------------------------------*/
/*  Block type:  FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/*  Purpose:     erase specified block                                                          */
/*  Input:       block_u16 - block number has to be erase                                       */
/*  Output:      -                                                                              */
/*  Returned:    fsl_u08, status_code                                                           */
/*                   = 0x00(FSL_OK), normal and means "block erased successfully"               */
/*                   = 0x05(FSL_ERR_PARAMETER), parameter error                                 */
/*                   = 0x10(FSL_ERR_PROTECTION), protection error                               */
/*                   = 0x1A(FSL_ERR_ERASE), erase error                                         */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0xFF(FSL_BUSY), normal and means "process was started"                   */
/*----------------------------------------------------------------------------------------------*/
extern __far_func fsl_u08  FSL_Erase(fsl_u16 block_u16);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      performs internal verify on specified block                                    */
/* Input:        block_u16 - block number has to be verified                                    */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status_code                                                           */
/*                   = 0x00(FSL_OK), normal and means "block is verified"                       */
/*                   = 0x05(FSL_ERR_PARAMETER), parameter error                                 */
/*                   = 0x1B(FSL_ERR_IVERIFY), internal verify error                             */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0xFF(FSL_BUSY), normal and means "process was started"                   */
/*----------------------------------------------------------------------------------------------*/
extern __far_func fsl_u08  FSL_IVerify(fsl_u16 block_u16);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      writes N words from the data buffer into flash                                 */
/* Input:        *write_pstr - struct fsl_write_t to write                                      */
/* Output:       -                                                                              */
/* Condition:    1) (&fsl_destination_address MOD 4 == 0)                                       */
/*               2) most significant byte (MSB) of fsl_destination_address_u32 has to be 0x00   */
/*                  Means: 0x00abcdef 24 bit flash address allowed                              */
/*               3) (0 < fsl_word_count_u08 <= 64)                                              */
/*               4) (fsl_word_count_u08 <= sizeof(data buffer))                                 */
/*                  NOT CHECKED BY FSL                                                          */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), normal                                                     */
/*                   = 0x05(FSL_ERR_PARAMETER), parameter error                                 */
/*                   = 0x10(FSL_ERR_PROTECTION), protection error                               */
/*                   = 0x1C(FSL_ERR_WRITE), write error                                         */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0xFF(FSL_BUSY), normal and means "process was started"                   */
/*----------------------------------------------------------------------------------------------*/
extern __far_func fsl_u08  FSL_Write(__near fsl_write_t __near* write_pstr);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      controls the flash action start/continue/check for the last called function    */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), normal                                                     */
/*                   = 0x1A(FSL_ERR_ERASE), erase error                                         */
/*                   = 0x1B(FSL_ERR_BLANKCHECK), blank-check error, means "block not blank"     */
/*                   = 0x1B(FSL_ERR_IVERIFY), internal verify error                             */
/*                   = 0x1C(FSL_ERR_WRITE), write error                                         */
/*                   = 0x1F(FSL_ERR_FLOW), violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0x30(FSL_IDLE), any action is not running                                */
/*                   = 0xFF(FSL_BUSY), normal and means "process was not finished"              */
/*----------------------------------------------------------------------------------------------*/
extern __far_func fsl_u08  FSL_StatusCheck(void);


